{
    "group_particle": "This block allows you to define a particle or group of particles.",
    "swap": "This block swaps the current particle with the particle found in the specified direction.",
    "copy_myself": "This block creates a duplicate of the current particle at the specified position.",
    "change_into": "This block changes the type of the particle in the specified direction to the selected type.",
    "touching": "This block is used to determine if the particle is touching a particle of a specific type in any of its eight directions.",
    "number_of": "This block returns the number of particles of a specific type in the specified direction. It allows you to count the number of particles in a particular direction.",
    "type_of": "Returns the type of the particule in the specified direction.",
    "particle_in_direction": "This block returns the type of the particle in the specified direction. It allows you to access the type of a particle in a particular direction.",
    "direction": "This block allows you to define a certain direction or random, which choose a random direction among the others",
    "randomTransformation": "This blocks determines that the logic excecuted will be random from the directions specified and generated by the clause.",
    "for_each_transformation": "These two blocks dictate changes in the behavior contained within them. They offer four clauses within the dropdown menu.",
    "rotated_by": "This block defines the behavior of a particle when it is rotated by a specified amount. It allows you to specify what actions the particle should take when it undergoes a rotation.",
    "controls_if": "The if block facilitates decision-making within a program. It allows you to define the actions a particle should take when a condition is met.",
    "one_in_chance": "This block is used to generate an event with a specific probability. When you place this block in your program, you are telling the program that you want an event to occur with a probability of one in every 'x' times, where 'x' is a number you choose.",
    "comparison": "This block is used to compare two numeric values based on three conditions: 'is equal to', 'is bigger than', and 'is smaller than'. It returns either true or false based on whether the specified condition is met.",
    "bool_comparison": "This block functions similarly to the numeric comparison block, but instead of comparing numeric values, it compares two boolean (true/false) values. It evaluates these boolean values based on two conditions: 'and' and 'or'. To return true, both boolean values must be true when using the 'and' condition, whereas the 'or' condition returns true when either or both conditions are true.",
    "boolean": "These blocks return either true or false depending on specific characteristics and their definitions. They are used within conditional blocks to make decisions based on certain conditions.",
    "not": "Takes a boolean value as input and returns the opposite of that value. if the input is true, it will return false and if the input is false, it will return true.",
    "custom_field_slider": "This block returns the number indicated by the slider. It allows you to specify a numeric value using a slider control.",
    "is": "This block is used to determine if a particle is touching a specific type of particle in a particular direction.",
    "random_from": "This block returns a random value between the two specified values, allowing you to generate random numbers within a specified range.",
    "particle_properties": "This block returns the value of the specified property of a particle in the specified direction. It allows you to access specific properties of particles within the simulation.",
    "increase_by": "This block increases the specified property of the particle in a direction by a certain amount.",
    "set_to": "This block sets the specified property of the particle in the specified direction to a certain value.",
    "repeat_n_times": "This block enables you to repeat a set of actions a specified number of times. It allows you to automate tasks by executing the same set of actions multiple times in sequence.",
    "every_n_frames": "This block allows you to define the behavior of a particle to occur at regular intervals, specifically every 'x' number of frames. It provides a way to schedule actions or events to happen periodically within the animation or simulation.",
    "note": "This block cannot be attached to any other block nor does it create any behavior. It allows you to create comments about your particle to explain its functionality."
}